Revit 2026 API

# TextNoteOptions(ElementId) Constructor

---

Constructs text options to create text of the given type.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public TextNoteOptions(
	ElementId typeId
)
```
```vb
Public Sub New (
	typeId As ElementId
)
```
```cpp
public:
TextNoteOptions(
	ElementId^ typeId
)
```
```fsharp
new :
        typeId : ElementId -> TextNoteOptions
```

#### Parameters

typeId ElementId
     Id of a text type that defines the style of a text note.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

Except for the TypeId, all other properties of the option class will be populated with their respective default values.

#### Reference

TextNoteOptions Class

TextNoteOptions Overload

Autodesk.Revit.DB Namespace